{
  "temas": {
    "ebook": 16,
    "lógica": 28,
    "programação": 67,
    "iniciantes": 16,
    "capítulo": 12,
    "aprender": 42,
    "porquê": 1,
    "precisa": 4,
    "preciso": 3,
    "saber": 6,
    "inglês": 20,
    "pra": 7,
    "linguagem": 30,
    "deve": 7,
    "escolher": 2,
    "criando": 4,
    "primeiros": 5,
    "programas": 4,
    "algoritmo": 8,
    "instalar": 1,
    "visualg": 1,
    "mão": 1,
    "massa": 1,
    "variáveis": 3,
    "constantes": 2,
    "tipos": 5,
    "dados": 6,
    "armazenar": 1,
    "memória": 1,
    "computador": 5,
    "diferênça": 1,
    "usar": 2,
    "https": 10,
    "diferença": 2,
    "primitivos": 1,
    "customizados": 1,
    "operadores": 2,
    "aritméticos": 1,
    "lógicos": 1,
    "relacionais": 1,
    "tomando": 2,
    "decisões": 8,
    "fazendo": 1,
    "software": 5,
    "tomar": 3,
    "decisão": 2,
    "muitas": 5,
    "opções": 1,
    "estrutura": 2,
    "controle": 1,
    "fluxo": 1,
    "hub": 1,
    "switch": 1,
    "loops": 2,
    "básicos": 3,
    "entendendo": 1,
    "estruturas": 1,
    "repetição": 2,
    "vez": 1,
    "todas": 4,
    "usada": 2,
    "vetores": 1,
    "matrizes": 1,
    "customizado": 1,
    "básico": 3,
    "computação": 1,
    "array": 1,
    "funções": 2,
    "procedimentos": 2,
    "criar": 5,
    "próprias": 1,
    "resolução": 1,
    "exercícios": 2,
    "i": 1,
    "think": 2,
    "everybody": 1,
    "in": 1,
    "this": 1,
    "country": 1,
    "should": 1,
    "learn": 1,
    "how": 2,
    "to": 2,
    "program": 1,
    "computer": 1,
    "because": 1,
    "it": 1,
    "teaches": 1,
    "you": 1,
    "steve": 2,
    "jobs": 2,
    "the": 1,
    "lost": 1,
    "interview": 1,
    "tradução": 1,
    "frase": 2,
    "acho": 2,
    "todos": 6,
    "neste": 5,
    "país": 1,
    "deveriam": 2,
    "programar": 11,
    "porque": 1,
    "ensina": 1,
    "pensar": 8,
    "disse": 2,
    "acima": 1,
    "penso": 1,
    "podemos": 1,
    "perceber": 3,
    "últimos": 1,
    "tempos": 1,
    "evolução": 2,
    "tecnológica": 1,
    "melhora": 1,
    "vida": 2,
    "pessoas": 9,
    "pilares": 1,
    "tecnologia": 2,
    "tempo": 4,
    "softwares": 12,
    "resolver": 3,
    "muitos": 5,
    "problemas": 5,
    "automatizar": 2,
    "tarefas": 4,
    "economizar": 1,
    "dinheiro": 1,
    "motivos": 1,
    "começar": 6,
    "motivo": 4,
    "mudar": 1,
    "ajuda": 1,
    "pensam": 4,
    "principalmente": 3,
    "desenvolver": 2,
    "disciplina": 4,
    "campo": 1,
    "filosofia": 1,
    "criado": 1,
    "aristóteles": 1,
    "cuida": 1,
    "regras": 1,
    "correto": 1,
    "sendo": 2,
    "portanto": 2,
    "instrumento": 1,
    "guia": 1,
    "raciocínio": 1,
    "humano": 1,
    "através": 3,
    "argumentos": 1,
    "chegar": 1,
    "conclusões": 1,
    "verdade": 3,
    "pessoa": 1,
    "aprende": 1,
    "desenvolve": 1,
    "nova": 6,
    "passam": 1,
    "tomadas": 1,
    "levando": 1,
    "consideração": 1,
    "pensamentos": 1,
    "sistêmicos": 1,
    "racionais": 1,
    "convergem": 1,
    "razão": 1,
    "humana": 1,
    "opinião": 2,
    "básica": 4,
    "educação": 2,
    "mundo": 6,
    "entrará": 1,
    "próxima": 1,
    "humanidade": 1,
    "alfabetização": 2,
    "fica": 1,
    "dia": 3,
    "inteiro": 2,
    "frente": 2,
    "facilidade": 1,
    "mexer": 1,
    "máquina": 5,
    "natural": 1,
    "velhas": 1,
    "cresceram": 1,
    "contato": 3,
    "atual": 3,
    "apesar": 1,
    "parecer": 1,
    "intimidante": 1,
    "início": 5,
    "tão": 3,
    "complicado": 1,
    "mesma": 1,
    "ler": 1,
    "escrever": 2,
    "fazer": 16,
    "cálculos": 1,
    "certeza": 2,
    "poucos": 2,
    "anos": 2,
    "ensinado": 2,
    "escolas": 1,
    "ensino": 3,
    "fundamental": 2,
    "tudo": 3,
    "parou": 1,
    "quantidade": 1,
    "coisas": 3,
    "direta": 1,
    "indiretamente": 1,
    "controladas": 1,
    "calculadoras": 1,
    "computadores": 1,
    "celulares": 1,
    "smartphones": 1,
    "tablets": 1,
    "internet": 4,
    "tvs": 1,
    "geladeiras": 1,
    "caixa": 1,
    "eletrônicos": 1,
    "linhas": 1,
    "produção": 1,
    "satélites": 2,
    "carros": 1,
    "impressoras": 1,
    "letreiros": 1,
    "digitais": 1,
    "drones": 1,
    "câmeras": 1,
    "semáforos": 1,
    "microcontroladores": 1,
    "pendrive": 1,
    "monte": 2,
    "coisa": 2,
    "ficaria": 1,
    "horas": 1,
    "talvez": 3,
    "dias": 1,
    "enumerando": 1,
    "volta": 2,
    "espécie": 1,
    "própria": 1,
    "controlado": 1,
    "dispositivos": 1,
    "controlados": 1,
    "toda": 1,
    "parte": 1,
    "seguimentos": 1,
    "industriais": 1,
    "agricultura": 1,
    "manufatura": 1,
    "logística": 1,
    "marketing": 1,
    "agropecuária": 1,
    "medicina": 1,
    "etc": 6,
    "atividades": 2,
    "onde": 1,
    "menos": 1,
    "imagina": 2,
    "têm": 2,
    "falando": 1,
    "presente": 1,
    "deixo": 1,
    "imaginação": 1,
    "livre": 2,
    "vem": 1,
    "próximos": 1,
    "controlam": 1,
    "máquinas": 1,
    "criamos": 1,
    "futuro": 1,
    "próximo": 1,
    "dirigir": 1,
    "preparado": 1,
    "participar": 1,
    "dessa": 2,
    "sabe": 4,
    "contaram": 1,
    "diferente": 2,
    "código": 1,
    "conseguem": 2,
    "entender": 5,
    "fundo": 2,
    "ensinar": 6,
    "resolvemos": 1,
    "tomamos": 1,
    "todo": 3,
    "organizar": 1,
    "resolve": 1,
    "toma": 1,
    "realiza": 1,
    "nada": 4,
    "instruções": 1,
    "equipamento": 1,
    "eletrônico": 1,
    "pode": 3,
    "seguir": 1,
    "executar": 3,
    "tarefa": 2,
    "autonomamente": 1,
    "conceito": 1,
    "códigos": 3,
    "achava": 1,
    "outro": 1,
    "começam": 2,
    "sentido": 1,
    "acredito": 1,
    "maior": 1,
    "predador": 1,
    "possível": 2,
    "prova": 1,
    "disso": 2,
    "ingressei": 1,
    "médio": 2,
    "técnico": 1,
    "informática": 1,
    "etpc": 1,
    "escola": 4,
    "técnica": 1,
    "sabia": 4,
    "pública": 2,
    "quase": 1,
    "importante": 5,
    "ressaltar": 1,
    "desmereço": 1,
    "momento": 2,
    "algum": 1,
    "professores": 1,
    "guerreiros": 1,
    "sabemos": 1,
    "sistema": 1,
    "público": 1,
    "brasileiro": 1,
    "lembro": 1,
    "primeiras": 1,
    "aulas": 1,
    "difícil": 2,
    "significado": 1,
    "comandos": 2,
    "professor": 1,
    "ensinava": 1,
    "sala": 1,
    "aula": 1,
    "juro": 1,
    "sentia": 1,
    "dificuldade": 3,
    "decorar": 2,
    "palavras": 2,
    "básicas": 1,
    "if": 1,
    "then": 1,
    "else": 1,
    "while": 1,
    "repeat": 1,
    "until": 1,
    "begin": 1,
    "bom": 3,
    "deu": 1,
    "pingo": 1,
    "vergonha": 1,
    "pequeno": 1,
    "obstáculo": 1,
    "caminho": 1,
    "ultrapassado": 1,
    "medo": 1,
    "basta": 2,
    "querer": 1,
    "esforçar": 1,
    "quero": 3,
    "dizer": 1,
    "logo": 2,
    "deste": 1,
    "sim": 2,
    "aliás": 2,
    "vão": 1,
    "português": 2,
    "programador": 3,
    "tutor": 1,
    "jornada": 1,
    "dever": 1,
    "falar": 1,
    "linguagens": 6,
    "profissionais": 1,
    "atualidade": 1,
    "precisará": 1,
    "pesquisar": 1,
    "evoluir": 1,
    "acredite": 1,
    "maioria": 2,
    "respostas": 2,
    "dúvidas": 1,
    "estarão": 1,
    "cara": 1,
    "passei": 1,
    "impeditivo": 1,
    "certamente": 1,
    "pedra": 1,
    "sapato": 1,
    "longo": 3,
    "carreira": 3,
    "ainda": 2,
    "souber": 2,
    "preocupe": 1,
    "junto": 1,
    "comece": 2,
    "estudos": 2,
    "paralelo": 1,
    "escrevi": 1,
    "post": 1,
    "sobre": 3,
    "blog": 1,
    "dicas": 1,
    "dê": 1,
    "olhada": 1,
    "quer": 6,
    "aprenda": 2,
    "pergunta": 2,
    "feita": 1,
    "aprendendo": 2,
    "devo": 1,
    "resposta": 1,
    "óbvia": 1,
    "ter": 2,
    "consciência": 1,
    "sempre": 2,
    "vantagens": 2,
    "desvantagens": 1,
    "dica": 1,
    "interessante": 2,
    "fanático": 1,
    "específica": 1,
    "defendem": 2,
    "unhas": 1,
    "dentes": 1,
    "afinidade": 1,
    "olhar": 1,
    "fóruns": 1,
    "melhor": 4,
    "cada": 2,
    "projeto": 1,
    "trabalho": 2,
    "indicada": 1,
    "decidir": 2,
    "base": 1,
    "gosto": 1,
    "pessoal": 1,
    "oferece": 1,
    "pretende": 2,
    "iniciante": 1,
    "procure": 2,
    "ajude": 2,
    "outra": 3,
    "profissional": 2,
    "java": 4,
    "c": 4,
    "python": 3,
    "totalmente": 1,
    "válido": 1,
    "fato": 1,
    "especialmente": 1,
    "algumas": 2,
    "podem": 1,
    "assimilar": 1,
    "conceitos": 2,
    "utilizando": 1,
    "nunca": 2,
    "programou": 1,
    "antes": 1,
    "indico": 1,
    "fortemente": 1,
    "aprendeu": 1,
    "voar": 1,
    "desenvolvimento": 2,
    "quiser": 2,
    "vou": 2,
    "confessar": 1,
    "comecei": 1,
    "queria": 1,
    "alunos": 1,
    "aprendessem": 1,
    "php": 1,
    "conseguir": 2,
    "tendo": 1,
    "exigidos": 1,
    "exemplo": 1,
    "programinha": 1,
    "hello": 1,
    "world": 1,
    "classe": 1,
    "método": 1,
    "exigir": 1,
    "estudante": 1,
    "escreva": 2,
    "específicas": 1,
    "class": 1,
    "public": 1,
    "static": 1,
    "void": 1,
    "main": 1,
    "nesse": 1,
    "ponto": 3,
    "boa": 1,
    "direto": 1,
    "aqui": 1,
    "entrar": 1,
    "discussão": 3,
    "x": 1,
    "y": 1,
    "muita": 1,
    "preferida": 1,
    "argumentam": 1,
    "apenas": 1,
    "mercado": 3,
    "deixar": 1,
    "claro": 1,
    "baseado": 2,
    "objetivo": 7,
    "utilize": 1,
    "ajudar": 1,
    "pronto": 1,
    "domina": 2,
    "arrumar": 1,
    "emprego": 4,
    "pesquise": 1,
    "pedida": 1,
    "vagas": 2,
    "atualmente": 1,
    "vá": 1,
    "embarcado": 1,
    "foguetes": 1,
    "sondas": 1,
    "mísseis": 1,
    "apropriada": 1,
    "embarcados": 1,
    "muda": 1,
    "moda": 1,
    "alta": 1,
    "amanhã": 1,
    "pense": 2,
    "nisso": 1,
    "curto": 1,
    "prazo": 1,
    "entendeu": 1,
    "paradigma": 3,
    "criadas": 1,
    "outros": 1,
    "paradigmas": 2,
    "completamente": 1,
    "lisp": 1,
    "prolog": 1,
    "ipl": 1,
    "utilizam": 1,
    "trabalham": 1,
    "mantenho": 1,
    "anterior": 1,
    "atingir": 1,
    "alguma": 2,
    "dessas": 1,
    "realmente": 1,
    "baseada": 1,
    "alcançar": 1,
    "sugiro": 1,
    "atuais": 1,
    "requerem": 1,
    "implementar": 2,
    "algoritmos": 2,
    "dedicando": 1,
    "pesquisas": 1,
    "descobri": 1,
    "dominam": 1,
    "vamos": 1,
    "utilizar": 1,
    "simples": 1,
    "transmitir": 1,
    "importantes": 1,
    "profissionalizar": 1,
    "exemplos": 1,
    "desse": 1,
    "ótimo": 1,
    "fique": 1,
    "vontade": 1,
    "escolha": 1,
    "mãos": 1,
    "obra": 1,
    "simplesmente": 1,
    "hora": 1,
    "afinal": 1,
    "primeiro": 1,
    "passo": 1,
    "envolve": 2,
    "educar": 1,
    "mente": 1,
    "explicar": 1,
    "detalhes": 1,
    "passos": 1,
    "necessários": 1,
    "determinada": 1,
    "modelar": 1,
    "roteiro": 2,
    "explica": 1,
    "realizar": 3,
    "determinadas": 1,
    "chamado": 1,
    "processadores": 1,
    "sabiam": 1,
    "somas": 3,
    "partir": 1,
    "operação": 1,
    "multiplicações": 1,
    "saiba": 1,
    "exatamente": 1,
    "imaginou": 1,
    "repetidas": 1,
    "aprendemos": 1,
    "multiplicação": 6,
    "pensou": 1,
    "faz": 1,
    "mostrar": 1,
    "faria": 1,
    "dois": 1,
    "números": 2,
    "positivos": 1,
    "declaração": 1,
    "resultado": 5,
    "contador": 5,
    "leia": 2,
    "enquanto": 1,
    "faça": 1,
    "fim": 1
  },
  "relacoes": {
    